# Rebar Create Free Form Method

Source: https://www.revitapidocs.com/2026/aadf041a-9564-e76e-4bc4-db4a3f861d84.htm

---

| Rebar Create Free Form Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateFreeForm(Document, Guid, RebarBarType, Element) | Creates a free form rebar that can have constraints. |
|  | CreateFreeForm(Document, RebarBarType, Element, IList CurveLoop , RebarFreeFormValidationResult ) | **Obsolete.** |
|  | CreateFreeForm(Document, RebarBarType, Element, IList CurveLoop , RebarStyle) |  |
|  | CreateFreeForm(Document, RebarBarType, Element, IList IList Curve , RebarFreeFormValidationResult ) | **Obsolete.** |
|  | CreateFreeForm(Document, RebarBarType, Element, IList IList Curve , RebarStyle) |  |

Top See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace